# 自定义类型的内容
poi_mytype = ['居住', '工作教育', '生活服务', '公共服务', '餐饮', '购物娱乐', '观光休闲']
poi_mytype_en = ['residence', 'work_edu', 'liv_serv', 'public_serv',
                 'dining', 'entertain', 'recreation']

# 从高德分类体系到自定义分类的映射
# 层嵌套dict的key表示高德分类的层次（type1和type2）
poi_ontology = {
    # 测试是否需要'住宿服务'（以旅馆为主）
    # '住宿服务': '居住',
    '公司企业': '工作教育',
    '生活服务': {'事务所': '工作教育', '中介机构': '工作教育', '人才市场': '工作教育',
                '信息咨询中心': '工作教育', '旅行社': '工作教育',
                 '电力营业厅': '生活服务', '电讯营业厅': '生活服务', '邮局': '生活服务',
             '摄影冲印店': '生活服务', '自来水营业厅': '生活服务', '婴儿服务场所': '生活服务'},
    '餐饮服务': '餐饮',
    '体育休闲服务': {'影剧院': '购物娱乐', '娱乐场所': '购物娱乐', '运动场馆': '购物娱乐',
               '高尔夫相关': '观光休闲', '度假疗养场所': '观光休闲', '休闲场所': '观光休闲',
               '体育休闲服务场所': '观光休闲'},
    '风景名胜': '观光休闲',
    '医疗保健服务': {'动物医疗场所': '公共服务', '疾病预防机构': '公共服务', '诊所': '公共服务',
               '综合医院': '公共服务', '急救中心': '公共服务', '专科医院': '公共服务'},
    '科教文化服务': {'科研机构': '工作教育', '培训机构': '工作教育', '学校': '工作教育',
                    '传媒机构': '工作教育',
                    '美术馆': '观光休闲', '科技馆': '观光休闲', '天文馆': '观光休闲',
                    '展览馆': '观光休闲', '会展中心': '观光休闲', '博物馆': '观光休闲'},
    '金融保险服务': {'保险公司': '工作教育', '证券公司': '工作教育', '金融保险服务机构': '工作教育',
                    '财务公司': '工作教育',
                    '银行': '生活服务'},
    '商务住宅': {'住宅区': '居住', '楼宇': '工作教育', '产业园区': '工作教育'},
    '政府机构及社会团体': '公共服务',
    '购物服务': '购物娱乐'
}

landuse_name = ['residence', 'business', 'shopping', 'industry', 'transport',
                'admin', 'educate', 'medical', 'sport_cul', 'park']
landuse_name_v2 = ['residence', 'business', 'shopping', 'industry', 'transport', 'sport_cul', 'park', 'public']

# 特殊TAZ标注
special_taz = [(538, '北大'), (574, '清华'), (503, '中关村'), (311, '金融街'), (527, '五道口'),
               (287, '国贸'), (294, '西单'), (575, '圆明园'), (553, '颐和园'), (580, '奥森'),
               (203, '天坛'), (414, '车道沟'), (114, '草桥')]
# special_taz_en = [(538, 'Peking Univ.'), (574, 'Tsinghua Univ.'), (503, 'Zhongguancun'), (311, 'Jinrong St.'),
#                   (527, 'Wudaokou'), (287, 'Guomao'), (294, 'Xidan'), (575, 'Yuanmingyuan park'), (553, 'Summer Palace'),
#                   (580, 'Olympic forest park'), (203, 'Temple of Heaven'), (414, 'Chedaogou'), (114, 'Caoqiao')]
special_taz_en = [(538, 'PKU'), (574, 'THU'), (503, 'ZGC'), (311, 'JRS'),
                  (287, 'GM'), (553, 'SP'), (580, 'OFP'), (203, 'TH'),
                  (414, 'CDG'), (114, 'CQ')]

# 研究区域的区县名称
quxian = ['东城区', '西城区', '朝阳区', '海淀区', '丰台区', '石景山区', '大兴区']
quxian_en = ['Dongcheng', 'Xicheng', 'Chaoyang', 'Haidian', 'Fengtai', 'Shijingshan', 'Daxing']

# 给聚类结果（城市功能）命名
mixuse_name = ['public', 'commercial', 'outdoor', 'residential', 'recreational']

